ConnectTest/src/Catalogs/cacheInformations/cacheInformations.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>cacheInformations</name>
  <attributes>
    <name>cacheType</name>
    <type>
      <types>CatalogRef.cacheTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>chain</name>
    <type>
      <types>CatalogRef.chains</types>
    </type>
  </attributes>
  <attributes>
    <name>data</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>endRotation</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>startRotation</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>user</name>
    <type>
      <types>CatalogRef.users</types>
    </type>
  </attributes>
</mdclass:Catalog>

ConnectTest/src/Catalogs/cacheInformations/ManagerModule.bsl
Procedure PresentationFieldsGetProcessing(fields, standardProcessing)
	standardProcessing = False;
	array = New Array();
	array.Add("cacheType");
	array.Add("user");	
	array.Add("startRotation");
	array.Add("endRotation");
	fields = array;
EndProcedure

Procedure PresentationGetProcessing(data, presentation, standardProcessing)
	standardProcessing = False;
	presentation = "" + data.cacheType + " / " + data.user + " / "
		+ Format(data.startRotation, "DF='dd.MM.yyyy'") + " - " + Format(data.endRotation, "DF='dd.MM.yyyy'");
EndProcedure
